## Plan Result (688: zr_sbox_acr - TerraformPlanApply)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 1 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-jenkins-cftptl-intsvc-mi-contributor&#34;]
* Delete
  * azurerm_role_assignment.zr_acr[&#34;hmctssbox-jenkins-cftptl-intsvc-mi-pull&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.zr_acr["hmctssbox-jenkins-cftptl-intsvc-mi-contributor"] will be created
  + resource "azurerm_role_assignment" "zr_acr" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.zr_acr["hmctssbox-jenkins-cftptl-intsvc-mi-pull"] will be destroyed
  # (because key ["hmctssbox-jenkins-cftptl-intsvc-mi-pull"] is not in for_each map)
  - resource "azurerm_role_assignment" "zr_acr" {
      - id                                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox/providers/Microsoft.Authorization/roleAssignments/8b9e35b5-4d67-acf8-e198-5c29108eb661" -> null
      - name                                   = "8b9e35b5-4d67-acf8-e198-5c29108eb661" -> null
      - principal_id                           = "ca6d5085-485a-417d-8480-c3cefa29df31" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/providers/Microsoft.Authorization/roleDefinitions/7f951dda-4ed3-4680-a7ca-43fe172d538d" -> null
      - role_definition_name                   = "AcrPull" -> null
      - scope                                  = "/subscriptions/bf308a5c-0624-4334-8ff8-8dca9fd43783/resourceGroups/cnp-acr-rg/providers/Microsoft.ContainerRegistry/registries/hmctssbox" -> null
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":44,"Program":"tfcmt","SHA1":"","Target":"688: zr_sbox_acr - TerraformPlanApply","Vars":{}} -->